name: "RenderForCNN"
layers {
  name: "data"
  type: DATA
  top: "data"
  data_param {
    #source: "/home/cad/disk/linux/RenderForCNN-master/data/vp_lmdb/head_angle/img_train_image"
    source: "/media/cad/0C66F84266F82DD8/vp_lmdb/head/img_train_lmdb"
    backend: LMDB
    batch_size: 448

  }
  transform_param {
    crop_size: 227
    mirror: false
    mean_file:"/home/cad/disk/linux/RenderForCNN-master/train/imagenet_mean.binaryproto"
  }
  include: { phase: TRAIN }

}
layers {
  name: "label"
  type: DATA
  top: "label"
  data_param {
    #source: "/home/cad/disk/linux/RenderForCNN-master/data/vp_lmdb/head_angle/img_train_label"
    source: "/media/cad/0C66F84266F82DD8/vp_lmdb/head/label_train_lmdb"
    backend: LMDB
    batch_size: 448
  }
  include: { phase: TRAIN }
}
layers {
  name: "data"
  type: DATA
  top: "data"
  data_param {
    source: "/home/cad/disk/linux/RenderForCNN-master/data/vp_lmdb/head/img_test_lmdb"
    backend: LMDB
    batch_size: 300

  }
  transform_param {
    crop_size: 227
    mirror: false
    mean_file:"/home/cad/disk/linux/RenderForCNN-master/train/imagenet_mean.binaryproto"
  }
  include: { phase: TEST }
}
layers {
  name: "label"
  type: DATA
  top: "label"
  data_param {
    source: "/home/cad/disk/linux/RenderForCNN-master/data/vp_lmdb/head/label_test_lmdb"
    backend: LMDB
    batch_size: 300
  }
  include: { phase: TEST }
}
layers {
  name: "labe-slice"
  type: SLICE
  bottom: "label"
  top: "label_class"
# if not fish
  top: "label_elevation"
  top: "label_azimuth"  
  slice_param {
    slice_dim: 1
    slice_point: 1
    slice_point: 2
  }
}
layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "data"
  top: "conv1"
  blobs_lr: 1
  blobs_lr: 1
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}
layers {
  name: "relu1"
  type: RELU
  bottom: "conv1"
  top: "conv1"
}
layers {
  name: "pool1"
  type: POOLING
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layers {
  name: "norm1"
  type: LRN
  bottom: "pool1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layers {
  name: "conv2"
  type: CONVOLUTION
  bottom: "norm1"
  top: "conv2"
  blobs_lr: 1
  blobs_lr: 1
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    group: 2
  }
}
layers {
  name: "relu2"
  type: RELU
  bottom: "conv2"
  top: "conv2"
}
layers {
  name: "pool2"
  type: POOLING
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layers {
  name: "norm2"
  type: LRN
  bottom: "pool2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layers {
  name: "conv3"
  type: CONVOLUTION
  bottom: "norm2"
  top: "conv3"
  blobs_lr: 1
  blobs_lr: 1
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}
layers {
  name: "relu3"
  type: RELU
  bottom: "conv3"
  top: "conv3"
}
layers {
  name: "conv4-new"
  type: CONVOLUTION
  bottom: "conv3"
  top: "conv4-new"
  blobs_lr: 1
  blobs_lr: 1
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    group: 2
  }
}
layers {
  name: "relu4"
  type: RELU
  bottom: "conv4-new"
  top: "conv4-new"
}
layers {
  name: "conv5-new"
  type: CONVOLUTION
  bottom: "conv4-new"
  top: "conv5-new"
  blobs_lr: 1
  blobs_lr: 1
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    group: 2
  }
}
layers {
  name: "relu5"
  type: RELU
  bottom: "conv5-new"
  top: "conv5-new"
}
layers {
  name: "pool5"
  type: POOLING
  bottom: "conv5-new"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layers {
  name: "fc6-new"
  type: INNER_PRODUCT
  bottom: "pool5"
  top: "fc6-new"
  blobs_lr: 1
  blobs_lr: 1
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}
layers {
  name: "relu6"
  type: RELU
  bottom: "fc6-new"
  top: "fc6-new"
}
layers {
  name: "drop6"
  type: DROPOUT
  bottom: "fc6-new"
  top: "fc6-new"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layers {
  name: "fc7-new"
  type: INNER_PRODUCT
  bottom: "fc6-new"
  top: "fc7-new"
  blobs_lr: 1
  blobs_lr: 1
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu7"
  type: RELU
  bottom: "fc7-new"
  top: "fc7-new"
}
layers {
  name: "drop7"
  type: DROPOUT
  bottom: "fc7-new"
  top: "fc7-new"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layers {
  name: "fc-azimuth-new"
  type: INNER_PRODUCT
  bottom: "fc7-new"
  top: "fc-azimuth-new"
  blobs_lr: 1
  blobs_lr: 1
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 360
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "loss_azimuth-new"
  type: SOFTMAX_WITH_VIEW_LOSS
  softmax_with_view_loss_param {
    bandwidth: 15
    sigma: 5
    pos_weight: 1
    neg_weight: 0
    period: 360
  }
  bottom: "fc-azimuth-new"
  bottom: "label_azimuth"
  top: "loss_azimuth-new"
  loss_weight: 1
}
layers {
  name: "accuracy_azimuth"
  type: ACCURACY_VIEW
  bottom: "fc-azimuth-new"
  bottom: "label_azimuth"
  top: "accuracy_azimuth"
  accuracy_view_param {
    tol_angle: 5
    period: 360
  }
}


layers {
  name: "fc-elevation-new"
  type: INNER_PRODUCT
  bottom: "fc7-new"
  top: "fc-elevation-new"
  blobs_lr: 1
  blobs_lr: 1
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 180
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "loss_elevation-new"
  type: SOFTMAX_WITH_VIEW_LOSS
  softmax_with_view_loss_param {
    bandwidth: 5
    sigma: 5
    pos_weight: 1
    neg_weight: 0
    period: 180
  }
  bottom: "fc-elevation-new"
  bottom: "label_elevation"
  top: "loss_elevation-new"
  loss_weight: 1
}

layers {
  name: "accuracy_elevation"
  type: ACCURACY_VIEW
  bottom: "fc-elevation-new"
  bottom: "label_elevation"
  top: "accuracy_elevation"
  accuracy_view_param {
    tol_angle: 5
    period: 180
  }
}

layers {
  name: "accuracy_class"
  type: ACCURACY
  bottom: "label_class"
  bottom: "label_class"
  top: "accuracy_class"
}
